src/tests/performance/zones-load.yml
config:
  target: "https://api.weather.gov"
  phases:
    - duration: 10
      arrivalRate: 1
  defaults:
    headers:
      Accept: "application/geo+json, application/json, */*"
      User-Agent: "copilot-playwright-poc-artillery/1.0"

scenarios:
  - name: "GET /zones smoke load"
    flow:
      - get:
          url: "/zones"